/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ykitamur </var/mail/ykitamur>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/04/11 13:40:31 by ykitamur          #+#    #+#             */
/*   Updated: 2022/04/12 19:11:10 by ykitamur         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//bzero() 関数は バイト列 s から始まる領域の先頭 n バイトを 数値ゼロ (値が '\0' のバイト) で埋める。 
#include "libft.h"


// int main(void)
// {
// 	char s[] = "1234567890";

// 	ft_bzero(s+2, 3);

// 	printf("%s", s);
// }

void	ft_bzero(void	*s, size_t	n)
{
	size_t i;
	char *str;
	
	i = 0;
	str = (char *)s;
	while (i < n)
	{
		str[i] = '\0';
		i++;
	}
}
